package main

import (
	"bufio"
	"fmt"
	"os"
)

/*
Условие задачи

Андрей прошел собеседование на позицию разработчика в известном маркетплейсе. И теперь его спросили какую зарплату он
бы себе хотел. Андрей, недолго думая, написал на листочке число — случайный набор цифр, который пришел ему в голову,
ведь он знает, чем больше цифр — тем больше число. В такой зарплате Андрею, к сожалению, отказали. Но его согласились
принять на работу при условии, что он сотрет ровно одну цифру из своего числа.

Андрей очень хочет работать в этом маркетплейсе, но также и не хочет много терять в своей зарплате, поэтому просит
вас убрать в его числе одну цифру так, чтобы число осталось как можно больше. Обратите внимание, что если изначальное
число содержит всего одну цифру, то убрав ее, Андрей получит число 0.
*/
func main() {
	var in *bufio.Reader
	var out *bufio.Writer
	in = bufio.NewReader(os.Stdin)
	out = bufio.NewWriter(os.Stdout)
	defer out.Flush()

	var a int
	fmt.Fscan(in, &a)
	for i := 0; i < a; i++ {
		var s string
		fmt.Fscan(in, &s)
		if len(s) == 1 {
			fmt.Fprintln(out, 0)
			continue
		}
		flag := false
		for j := 0; j < len(s)-1; j++ {
			if s[j] < s[j+1] {
				flag = true
				fmt.Fprintln(out, s[:j]+s[j+1:])
				break
			}
		}
		if !flag {
			fmt.Fprintln(out, s[:len(s)-1])
		}
	}

	//fmt.Fprint(out, a+b)
}
