package task3

/*
Условие задачи:
  Вы разрабатываете систему маппинга товаров на идентификаторы, которые могут меняться со временем.
  Система должна поддерживать запросы для изменения и получения идентификаторов товаров.

  Формат запросов:
    1. CHANGE name id — назначает (или меняет) товару с именем name идентификатор id.
       Если в данный момент существует товар с идентификатором id, то его идентификатор сбрасывается.
    2. GET id time — выводит имя товара, который имел идентификатор id после выполнения запроса в момент времени time.
       Если товара с таким id не было, выведите "404".

Входные данные:
  Первая строка содержит целое число t (1 ≤ t ≤ 3⋅10^5) — количество наборов данных.
  Далее следуют описания наборов данных:
    1. Первая строка набора содержит одно целое число n (1 ≤ n ≤ 3⋅10^5) — количество запросов к системе.
    2. Следующие n строк содержат запросы в одном из двух форматов:
        - CHANGE name id: name — непустая строка длиной до 10 символов, состоящая из строчных латинских букв или цифр; 1 ≤ id ≤ 10^5.
        - GET id time: 1 ≤ id ≤ 10^5; time < i, где i — текущая секунда.

Выходные данные:
  Для каждого запроса GET выводится имя товара, либо "404", если товара с таким id не существовало в указанный момент времени.

Пример:
  Входные данные:
  2
  2
  CHANGE product1 10
  GET 10 1
  6
  CHANGE product1 10
  CHANGE product1 20
  GET 10 1
  GET 10 3
  CHANGE product2 20
  GET 20 5

  Выходные данные:
  product1
  product1
  404
  product2
*/
