package task4

/*
Условие задачи:
  Необходимо написать валидатор для проверки правильности выходных данных задачи сортировки массива.

  Формат входных данных:
    - Первая строка содержит целое число t (1 ≤ t ≤ 10^5) — количество наборов входных данных.
    - Каждая следующая строка содержит:
      1. Число n (1 ≤ n ≤ 10^5) — количество элементов в массиве.
      2. Массив a, состоящий из n целых чисел (-10^9 ≤ a_i ≤ 10^9), разделённых пробелами.
      3. Выходные данные — отсортированный массив, который надо проверить.

  Гарантируется:
    - Числа n и a_i не содержат ведущих нулей.
    - Размер входного файла не превышает 10 Мб.

  Формат выходных данных:
    Для каждого набора входных данных выведите "YES", если выходные данные корректны, и "NO", если нет.

Пример:

Входные данные:
6
1
228
228
1
228
hello
1
228
-1
4
1 2 3 4
1 2 4
2
2 2
2 2 8
2
1 2
2 1

Выходные данные:
yes
no
no
no
no
no
*/
