package task7

/*
Условие задачи:
В королевстве Артистия готовится выставка в Галерее искусств. Мастера прислали свои лучшие картины,
и кураторам нужно упаковать все произведения в специальные защитные коробки для транспортировки.

Имеется n коробок с размерами a_i (ширина) и b_i (длина). Также есть m картин с размерами c_j (ширина) и d_j (длина).
Каждая картина должна быть упакована в коробку, которая ее полностью вмещает
(минимальная и максимальная стороны картины должны быть меньше или равны минимальной и максимальной сторонам коробки).
Коробки могут вместить неограниченное количество картин.

Необходимо найти минимальное количество коробок, необходимых для упаковки всех картин. Если упаковка невозможна, нужно вывести -1.

Входные данные:
t — количество тестов (1 ≤ t ≤ 10^5)
Для каждого теста:
- n — количество коробок (1 ≤ n ≤ 10^5)
- Далее n строк с двумя числами a_i, b_i (1 ≤ a_i, b_i ≤ 10^9) — размеры коробок.
- m — количество картин (1 ≤ m ≤ 10^5)
- Далее m строк с двумя числами c_j, d_j (1 ≤ c_j, d_j ≤ 10^9) — размеры картин.

Выходные данные:
Выведите одно число — минимальное количество коробок для упаковки всех картин. Если это невозможно, выведите -1.

Пример:
Входные данные:
2
3
1 10
3 3
5 2
3
4 2
9 1
2 2
2
1 10
3 3
1
4 2

Выходные данные:
2
-1
*/
