package task2

/*
Антон учит Степана делить массивы одинаковой длины n друг на друга следующим образом: если
ai нацело делится на bi для всех 1≤i≤n, то массив a делится на массив b.

В качестве упражнения, Степан всегда использует массив [1,2,…,n] в качестве делителя.
Теперь он хочет посчитать количество возможных массивов a, которые делятся на заданный делитель.
Но Антон догадался, что таких массивов бесконечно много, поэтому для Степана он наложил на построение массива a
следующие ограничение: li ≤ ai ≤ ri для всех 1 ≤ i ≤ n, где l и r — подготовленные заранее Антоном массивы.

Но после введения таких ограничений, посчитать ответ оказалось слишком трудно, поэтому ребята просят вас им помочь.

Входные данные:
  Стандартный ввод содержит несколько наборов входных данных.

  Первая строка содержит целое число t (1 ≤ t ≤ 10^5) — количество наборов входных данных.

  Далее следуют описания наборов:
    Первая строка каждого набора содержит целое число n (1 ≤ n ≤ 10^5).
    Вторая строка каждого набора содержит n целых чисел li (1 ≤ li ≤ 10^9) — массив l.
    Третья строка каждого набора содержит n целых чисел ri (1 ≤ ri ≤ 10^9) — массив r.

  Гарантируется, что сумма n по всем наборам не превосходит 10^5.

Выходные данные:
  Для каждого набора входных данных выведите количество возможных вариантов массива a при заданных ограничениях.
  Так как ответ может быть очень большим, выведите остаток от деления ответа на 10^9 + 7.

Пример:
  В первом наборе данных существует 4 подходящих массива: [1, 2, 3], [1, 4, 3], [2, 2, 3], [2, 4, 3].

  В третьем наборе ответ равен 41916958083, но вывести нужно остаток от деления на 10^9 + 7:
  41916958083 mod (10^9 + 7) = 916957796.
*/
