package task5

/*
Условие задачи:
  Необходимо реализовать конвертер из формата YAML в формат INI. YAML-файл содержит только словари произвольной вложенности.

  Формат входных данных:
    - Первая строка содержит целое число t (1 ≤ t ≤ 5⋅10^4) — количество наборов данных.
    - Для каждого набора входных данных:
      1. Первая строка набора содержит целое число n (1 ≤ n ≤ 10^5) — количество строк в YAML-файле.
      2. Следующие n строк описывают YAML-файл.

  Преобразование данных в формат INI:
    - Пары ключ-значение выводятся в формате "key = value".
    - Путь до каждого ключа выводится в формате "[section1.section2]", если ключ находится в секции.
    - Путь выводится ровно один раз перед группой подряд идущих ключ-значений с одинаковым путём.
    - Если путь до ключа пустой (нет вложенных секций), то его опускают.
    - Между группами ключ-значение необходимо выводить одну пустую строку.

  Выходные данные:
    Для каждого набора входных данных выведите преобразованный INI-файл, соблюдая форматирование.
    После вывода каждого INI-файла следует вывести одну пустую строку.

Пример:

Входные данные:
2
16
a: b
b:
    c:
        d: e
    d: e
    e: f
    a:
        a: hello
    b:
        a: hi
    f: a
route: contest
good:
    luck:
        for: you
c: d
1
ozon: route

Выходные данные:
a = b

[b.c]
d = e

[b]
d = e
e = f

[b.a]
a = hello

[b.b]
a = hi

[b]
f = a

route = contest

[good.luck]
for = you

c = d

ozon = route
*/
