package task8

/*
Условие задачи:
В сети из n компьютеров произошёл сбой — все компьютеры выключились.
Вам необходимо включить максимальное количество компьютеров, используя m рычагов,
каждый из которых изменяет состояние двух компьютеров: a_i и b_i.
При использовании i-го рычага состояние компьютеров a_i и b_i изменяется на противоположное.

Определите, какие рычаги необходимо переключить, чтобы включить максимальное количество компьютеров.

Входные данные:
t — количество тестов (1 ≤ t ≤ 5 * 10^4)
Для каждого теста:
- n и m — количество компьютеров (2 ≤ n ≤ 10^5) и количество рычагов (1 ≤ m ≤ 10^5)
- m строк с двумя числами a_i и b_i (1 ≤ a_i, b_i ≤ n, a_i ≠ b_i) — номера компьютеров, состояние которых меняет i-й рычаг.

Выходные данные:
Для каждого теста выведите три строки:
1. Максимально возможное количество включённых компьютеров.
2. Количество использованных рычагов.
3. Номера использованных рычагов (числа, разделённые пробелом).

Пример:
Входные данные:
3
4 4
1 2
2 3
3 4
4 1
5 4
1 2
3 4
4 5
3 5
6 4
2 3
2 3
4 5
5 6

Выходные данные:
4
2
3 1
4
2
1 3
4
2
1 4
*/
